{
  "cryptocompare_cache": {
    "cryptocompare_all": {
      "data": [
        {
          "id": "54394406",
          "title": "Nasdaq turns selloff around amid valuation worries, big tech recovers",
          "body": "5 Signs Why Investors Should Be More Cautious Market Cycles, Not Headlines: What History Says About The 2025 Rally And What Comes Next AAII Sentiment Survey: Pessimism Takes Flight US Senate passes bill to end longest ever government shutdown, sending it to House",
          "published_at": 1763136294,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/news/4522339-sp500-nasdaq-composite-dow-jones-stock-market-news?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=news",
          "categories": [
            "BUSINESS",
            "MARKET",
            "REGULATION",
            "TRADING",
            "MACROECONOMICS"
          ],
          "tags": [
            "DJI",
            "SP500",
            "COMP:IND",
            "XLK",
            "GOOG",
            "AXP",
            "JPM",
            "GS",
            "V",
            "TSLA",
            "META",
            "BTC-USD",
            "XAGUSD:CUR",
            "XAUUSD:CUR",
            "CL1:COM",
            "US10Y",
            "US2Y",
            "US30Y",
            "US5Y"
          ]
        },
        {
          "id": "54395908",
          "title": "Ripple CEO Breaks Silence After First Spot XRP ETF Hits $26 Million in 30 Minutes",
          "body": "Ripple has finally reached the moment it's been fighting for for years. The first spot XRP ETF has launched in the United States, and CEO Brad Garlinghouse has immediately jumped online to acknowledge what the market has been waiting for since the early days of the SEC v. Ripple case. His brief article carried the weight of a decade-long struggle: regulatory crackdowns, court delays, and an industry watching as XRP remained the only top-tier asset without an ETF product. Today, that era has ende",
          "published_at": 1763136189,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/ripple-ceo-breaks-silence-after-first-spot-xrp-etf-hits-26-million-in-30-minutes/",
          "categories": [
            "MARKET",
            "REGULATION",
            "SPONSORED",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Sponsored"
          ]
        },
        {
          "id": "54395817",
          "title": "New XRP ETF Might Launch Sooner Than Expected",
          "body": "The Bitwise XRP ETF may be the next XRP ETF to launch, and it might launch sooner than the expected November 19 date as the SEC fast-tracks the process upon resumption.",
          "published_at": 1763136060,
          "source": "CryptoCompare",
          "url": "https://u.today/new-xrp-etf-might-launch-sooner-than-expected",
          "categories": [
            "REGULATION",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "XRP"
          ]
        },
        {
          "id": "54395819",
          "title": "Alderney Eyes Bitcoin Mining To Become The Next ‘BTC Island’",
          "body": "At Bitcoin Amsterdam on 13 November, Alderney politician Edward Hill delivered a direct pitch to the BTC community: help turn his tiny Channel Island into a Bitcoin-first jurisdiction, anchored in renewable energy and a pro-BTC regulatory stance. Hill opened by situating Alderney politically and geographically. “I’m from the little island of Alderney, which you may know are sister islands, Jersey and Guernsey that are traditional finance centers,” he said. “We are a Channel Island, but we are se",
          "published_at": 1763136051,
          "source": "CryptoCompare",
          "url": "https://bitcoinist.com/alderney-bitcoin-mining-next-btc-island/",
          "categories": [
            "BTC",
            "BUSINESS",
            "MINING",
            "REGULATION",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin News",
            "bitcoin",
            "Bitcoin Amsterdam",
            "bitcoin news",
            "bitcoin price",
            "btc",
            "BTC news",
            "btc price",
            "State of Alderney"
          ]
        },
        {
          "id": "54395785",
          "title": "Shocking Bitcoin donations case: Detroit man gets 9 years for funding ISIS",
          "body": "BitcoinWorld Shocking Bitcoin donations case: Detroit man gets 9 years for funding ISIS In a shocking development that highlights the growing intersection of cryptocurrency and national security, a Detroit man has been sentenced to nine years in prison for concealing Bitcoin donations to ISIS. This case represents one of the most significant prosecutions involving cryptocurrency and terrorist financing in recent years. How were these Bitcoin donations concealed? Jibreel Pratt used sophisticated ",
          "published_at": 1763136012,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/bitcoin-donations-isis-sentencing/",
          "categories": [
            "BTC",
            "REGULATION",
            "TECHNOLOGY",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "#ISIS",
            "BITCOIN",
            "criminal sentencing",
            "cryptocurrency regulation",
            "Digital Currency"
          ]
        },
        {
          "id": "54395839",
          "title": "CFO Convicted for Losing $35 Million of Company Money in Crypto Side Hustle",
          "body": "Nevin Shetty invested the stolen funds in DeFi lending protocols in 2022, and was starting to turn a handsome profit—until Terra and the broader crypto market collapsed.",
          "published_at": 1763135978,
          "source": "CryptoCompare",
          "url": "https://decrypt.co/348693/cfo-convicted-losing-35-million-crypto-side-hustle",
          "categories": [
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "",
            "terra-luna-2",
            "Law and Order"
          ]
        },
        {
          "id": "54395778",
          "title": "Starknet, Zcash, and Dash Advance On Selective Altcoin Season Flows",
          "body": "Altcoin movement remains uneven , yet activity has concentrated around assets with functioning ecosystems and measurable on-chain or exchange participation. Starknet, Zcash, and Dash were among the few to record strong daily gains, showing that capital continues to rotate into names with distinct usage patterns even when sentiment across the market remains cautious. Liquidity has stayed consistent across active venues, allowing certain coins to advance without relying on extreme leverage or shor",
          "published_at": 1763135944,
          "source": "CryptoCompare",
          "url": "https://cryptonews.com/news/starknet-zcash-and-dash-advance-on-selective-altcoin-season-flows/",
          "categories": [
            "ALTCOIN",
            "BLOCKCHAIN",
            "MARKET",
            "TRADING",
            "ZEC"
          ],
          "tags": [
            "Altcoin News",
            "News",
            "Altcoin",
            "altcoin season",
            "zcash"
          ]
        },
        {
          "id": "54395653",
          "title": "Strategy dismisses Bitcoin sell-off rumors, doubles down on accumulation",
          "body": "Panic swept crypto markets Friday when blockchain trackers flagged transfers of up to 58,000 BTC from Strategy-linked wallets, sparking viral sell-off claims. But CEO Michael Saylor quickly crushed the FUD on CNBC and X.",
          "published_at": 1763135762,
          "source": "CryptoCompare",
          "url": "https://ambcrypto.com/strategy-dismisses-bitcoin-sell-off-rumors-doubles-down-on-accumulation/",
          "categories": [
            "BLOCKCHAIN",
            "BTC",
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin",
            "News",
            "News 1",
            "Social",
            "Trading View"
          ]
        },
        {
          "id": "54395648",
          "title": "Bitcoin Price Analysis: BTC Sinks To $95,000 As Liquidations Top $1 Billion",
          "body": "Bitcoin’s ( BTC ) slump below $100,000 has intensified as the flagship cryptocurrency fell to its lowest level in six months. The flagship cryptocurrency is down nearly 7%, trading around $95,893. CoinGlass data shows significant liquidations in the market, with total liquidations crossing $1 billion in the past 24 hours. Out of this, $887 million were long positions, while $135 million were short positions. Spot Bitcoin ETFs Record Nearly $900 Million One-Day Outflow US spot Bitcoin ETFs regist",
          "published_at": 1763135738,
          "source": "CryptoCompare",
          "url": "https://bitzo.com/2025/11/bitcoin-price-analysis-btc-sinks-to-95000-as-liquidations-top-1-billion",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "ZRX",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Breaking News",
            "Bitcoin"
          ]
        },
        {
          "id": "54395654",
          "title": "BTCS Shatters Records with Stunning Q3 Revenue Surge",
          "body": "BitcoinWorld BTCS Shatters Records with Stunning Q3 Revenue Surge Have you ever wondered how blockchain companies are transforming traditional finance? BTCS just delivered a masterclass in digital asset performance, posting record Q3 revenue that’s turning heads across the cryptocurrency industry. This Nasdaq-listed company’s strategic moves are rewriting the rules of blockchain business profitability. How Did BTCS Achieve This Record Q3 Revenue? The numbers speak volumes about BTCS’s successful",
          "published_at": 1763135710,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/btcs-record-q3-revenue/",
          "categories": [
            "BLOCKCHAIN",
            "BUSINESS",
            "ETH",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "blockchain revenue",
            "BTCs",
            "Cryptocurrency earnings",
            "DeFi strategies",
            "ETHEREUM"
          ]
        },
        {
          "id": "54395875",
          "title": "Stable Returns in a Shaky Market: The Case for XRP Tundra Staking Yield",
          "body": "Crypto markets have entered another period of heightened volatility, with short-term swings once again dominating headlines. Yet beneath the noise, a different trend is emerging among informed XRP holders: the shift toward predictable yield. Instead of relying solely on price appreciation, many are adopting staking models that generate returns regardless of market direction. XRP Tundra has positioned its Cryo Vault system at the center of this shift, offering staking mechanics designed for users",
          "published_at": 1763135652,
          "source": "CryptoCompare",
          "url": "https://cryptodaily.co.uk/2025/11/stable-returns-in-a-shaky-market-the-case-for-xrp-tundra-staking-yield",
          "categories": [
            "MARKET",
            "MINING",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "More News"
          ]
        },
        {
          "id": "54395602",
          "title": "Dogecoin Treasury Bet Backfires: CleanCore Stock Crashes 78% to Record Low",
          "body": "CleanCore Solutions’ aggressive push into Dogecoin as an official treasury asset has triggered a market backlash, with the company’s stock collapsing nearly 78% over the last month as investors weigh deep quarterly losses and a sharp downturn in DOGE’s price. The stock, which trades under the ticker ZONE on the NYSE American, fell to a record low of $0.3818 this week and ended Thursday’s session down almost 12%. Source: Yahoo Finance The decline continued into Friday, deepening concerns over its",
          "published_at": 1763135591,
          "source": "CryptoCompare",
          "url": "https://cryptonews.com/news/dogecoin-treasury-bet-backfires-cleancore-stock-crashes-78-to-record-low/",
          "categories": [
            "DOGE",
            "REGULATION",
            "DIGITAL ASSET TREASURY",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoin News",
            "Blockchain News",
            "News",
            "DOGE",
            "Stocks",
            "Treasury"
          ]
        },
        {
          "id": "54395621",
          "title": "BlackRock's BUIDL Now Accepted as Collateral on Binance",
          "body": "BlackRock's BUIDL, the world's biggest tokenized RWA fund, lands on BNB Chain as integration with Binance is announced.",
          "published_at": 1763135580,
          "source": "CryptoCompare",
          "url": "https://u.today/blackrocks-buidl-now-accepted-as-collateral-on-binance",
          "categories": [
            "EXCHANGE",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Binance"
          ]
        },
        {
          "id": "54352578",
          "title": "Certora Partners with Cork and Hypernative to Set a New Standard for Web3 Security",
          "body": "",
          "published_at": 1763135421,
          "source": "CryptoCompare",
          "url": "https://www.investing.com/news/cryptocurrency-news/certora-partners-with-cork-and-hypernative-to-set-a-new-standard-for-web3-security-4355938",
          "categories": [
            "OTHER"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "54395469",
          "title": "Stunning 250 Million USDC Minted: What This Massive Stablecoin Creation Means for Crypto Markets",
          "body": "BitcoinWorld Stunning 250 Million USDC Minted: What This Massive Stablecoin Creation Means for Crypto Markets Have you ever wondered what happens when millions of dollars in stablecoins suddenly appear in the crypto ecosystem? Whale Alert just reported a massive 250 million USDC minted at the USDC Treasury, sending ripples through the cryptocurrency community. This significant event represents one of the largest stablecoin creations we’ve seen recently, and it’s crucial to understand what this m",
          "published_at": 1763135411,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/usdc-minted-crypto-impact-3/",
          "categories": [
            "BLOCKCHAIN",
            "MARKET",
            "TRADING",
            "USDC",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "BLOCKCHAIN",
            "Crypto news",
            "CRYPTOCURRENCY",
            "Digital Assets",
            "Stablecoins"
          ]
        },
        {
          "id": "54395452",
          "title": "Circle Internet Group: Earn A 22% Yield Selling Options On This Stablecoin Juggernaut",
          "body": "Summary Circle Internet Group remains a long-term growth story, but shares are still expensive despite a recent 60% pullback. Selling put options on CRCL, specifically the February $65 strike, offers a 22%+ annualized yield and a lower entry point if assigned. CRCL's revenue growth is driven by stablecoin adoption, but falling rates and rising costs present near-term headwinds and risks. We maintain a Hold rating on CRCL, and we favor selling puts over buying shares outright for yield-oriented i",
          "published_at": 1763135374,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/article/4843865-circle-internet-group-earn-a-22-percent-yield-selling-options-on-this-stablecoin-juggernaut?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=article",
          "categories": [
            "BUSINESS",
            "FIAT",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "CRCL"
          ]
        },
        {
          "id": "54395729",
          "title": "ICBA flags risks in Sony stablecoin proposal",
          "body": "The Independent Community Bankers of America (ICBA) is opposing Sony Bank’s bid for a national trust charter to issue stablecoins. The offer, according to the ICBA, exploits regulatory gaps that could put customers at significant risk. Last week, ICBA sent a letter to the Office of the Comptroller of the Currency (OCC) claiming that Sony Bank intends to use Connectia Trust for cryptocurrency-related activities. On October 6, Sony Bank filed to create Connectia Trust, a company that would offer d",
          "published_at": 1763135359,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/icba-warns-sony-stablecoin-risks/",
          "categories": [
            "BUSINESS",
            "EXCHANGE",
            "FIAT",
            "REGULATION",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "BPI",
            "Circle",
            "FDIC",
            "ICBA",
            "Ripple"
          ]
        },
        {
          "id": "54395493",
          "title": "Shibarium Transactions Hits 14-Day High, SHIB Price Reacts",
          "body": "Shibarium has triggered new hope for the SHIB community with a sudden transaction spike.",
          "published_at": 1763135340,
          "source": "CryptoCompare",
          "url": "https://u.today/shibarium-transactions-hit-14-day-high-shib-price-reacts",
          "categories": [
            "SHIB",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Shibarium"
          ]
        },
        {
          "id": "54395386",
          "title": "Eric Trump Shrugs Off Crypto Rout, Eyes Real Estate Tokenization - WSJ",
          "body": "",
          "published_at": 1763135295,
          "source": "CryptoCompare",
          "url": "https://www.investing.com/news/cryptocurrency-news/eric-trump-shrugs-off-crypto-rout-eyes-real-estate-tokenization--wsj-432SI-4359568",
          "categories": [
            "OTHER"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "54395337",
          "title": "Rate Cuts Danger: Why Kansas City Fed’s Schmid Warns Further Reductions Could Seriously Hurt Inflation",
          "body": "BitcoinWorld Rate Cuts Danger: Why Kansas City Fed’s Schmid Warns Further Reductions Could Seriously Hurt Inflation Federal Reserve officials are sounding the alarm about potential economic dangers ahead. Kansas City Fed President Jeffrey Schmid recently delivered a stark warning that additional rate cuts could seriously hurt inflation progress. This cautious stance comes at a critical moment for monetary policy decisions. Why Could Further Rate Cuts Hurt Inflation Control? Schmid emphasized tha",
          "published_at": 1763135111,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/rate-cuts-hurt-inflation-warning/",
          "categories": [
            "BUSINESS",
            "FIAT",
            "MARKET",
            "TRADING",
            "MACROECONOMICS"
          ],
          "tags": [
            "Crypto News",
            "economic outlook",
            "Federal Reserve",
            "Inflation",
            "interest rates",
            "monetary policy"
          ]
        },
        {
          "id": "54395318",
          "title": "This $2.5 Billion BlackRock Fund Is Coming to Binance and BNB Chain",
          "body": "BlackRock’s $2.5 billion USD Institutional Digital Liquidity Fund (BUIDL) is expanding to Binance and BNB Chain, Securitize said Friday.",
          "published_at": 1763135046,
          "source": "CryptoCompare",
          "url": "https://decrypt.co/348715/2-5-billion-blackrock-fund-coming-binance-bnb-chain",
          "categories": [
            "BUSINESS",
            "EXCHANGE",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "",
            "Business"
          ]
        },
        {
          "id": "54395259",
          "title": "As Ethereum (ETH) Strengthens Against Bitcoin (BTC), This Could Benefit XRP the Most! Here Are the Details…",
          "body": "Leading cryptocurrencies Bitcoin (BTC), Ethereum (ETH), and altcoins are experiencing a major correction. At this point, BTC has fallen below $95,000, while ETH finds support around $3,100. While there are analyses suggesting that the correction could deepen further, one analyst noted that Ethereum remains relatively robust against Bitcoin. Accordingly, market analyst Omkar Godbole said that Ethereum has been relatively strong against Bitcoin despite the ongoing strong correction in the market, ",
          "published_at": 1763134992,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/as-ethereum-eth-strengthens-against-bitcoin-btc-this-could-benefit-xrp-the-most-here-are-the-details/",
          "categories": [
            "BTC",
            "ETH",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "Bitcoin",
            "Ethereum",
            "News",
            "XRP"
          ]
        },
        {
          "id": "54395232",
          "title": "Bitcoin Black Friday: Tether CEO Reacts to BTC Surprising Crash Below $100,000",
          "body": "Bitcoin saw a crash below $95,000 for the first time since May this year; Tether CEO reacts to Bitcoin crash, which wiped out $676 million in BTC liquidations.",
          "published_at": 1763134920,
          "source": "CryptoCompare",
          "url": "https://u.today/bitcoin-black-friday-tether-ceo-reacts-to-btcs-surprising-crash-below-100000",
          "categories": [
            "BTC",
            "USDT",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin",
            "BTC"
          ]
        },
        {
          "id": "54395210",
          "title": "Stunning 250 Million USDC Minted: What This Massive Stablecoin Creation Means for Crypto Markets",
          "body": "BitcoinWorld Stunning 250 Million USDC Minted: What This Massive Stablecoin Creation Means for Crypto Markets In a stunning development that’s shaking up the cryptocurrency world, Whale Alert just reported that a massive 250 million USDC has been freshly minted at the USDC Treasury. This enormous stablecoin creation represents one of the largest single minting events we’ve seen recently, and it’s sending ripples across digital asset markets. But what does this actually mean for investors and the",
          "published_at": 1763134812,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/250-million-usdc-minted-impact/",
          "categories": [
            "FIAT",
            "MARKET",
            "TRADING",
            "USDC",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "BLOCKCHAIN",
            "CRYPTOCURRENCY",
            "Digital Assets",
            "Stablecoin",
            "USDC"
          ]
        },
        {
          "id": "54395066",
          "title": "Circle Internet raised to Outperform at Baird on stablecoin growth, strong Q3",
          "body": "More on Circle Internet Group, Inc. Circle Internet Group, Inc. (CRCL) Q3 2025 Earnings Call Transcript Q3-25 Earnings: Circle's Valuation & Revenue Concentration Problems Circle Internet Group, Inc. 2025 Q3 - Results - Earnings Call Presentation Circle Internet raised to Outperform at Baird on stablecoin growth, strong Q3 Circle Internet double upgraded at J.P. Morgan after Q3 earnings results on better fundamentals",
          "published_at": 1763134587,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/news/4522363-circle-internet-raised-to-outperform-at-baird-on-stablecoin-growth-strong-q3?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=news",
          "categories": [
            "BUSINESS",
            "TRADING"
          ],
          "tags": [
            "CRCL",
            "MA",
            "FISV",
            "V",
            "USDC-USD"
          ]
        },
        {
          "id": "54395168",
          "title": "How Liquidity Stress and Tax Moves Are Dragging Bitcoin Down",
          "body": "Bitcoin (BTC) has fallen below $95,000 as U.S.-centric selling pressures and liquidity tightening converge to weigh heavily on the market. Analysts are now warning that the drop is not a mere price fluctuation but a structural correction shaped by long-term holder profit-taking, fiscal constraints, and short-term investor stress. A Perfect Storm of U.S. Selling Pressure According to an analysis from XWIN Research Japan, the Coinbase Premium Index has been negative for weeks, meaning BTC is tradi",
          "published_at": 1763134570,
          "source": "CryptoCompare",
          "url": "https://cryptopotato.com/how-liquidity-stress-and-tax-moves-are-dragging-bitcoin-down/",
          "categories": [
            "BTC",
            "MARKET",
            "REGULATION",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "AA News",
            "Crypto News",
            "Bitcoin",
            "Bitcoin (BTC) Price"
          ]
        },
        {
          "id": "54395042",
          "title": "Bitcoin (BTC) Price Analysis  for November 14",
          "body": "Can bulls restore the rate of Bitcoin (BTC) above $100,000 by the end of the week?",
          "published_at": 1763134560,
          "source": "CryptoCompare",
          "url": "https://u.today/bitcoin-btc-price-analysis-for-november-14",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin Price Prediction",
            "BTC"
          ]
        },
        {
          "id": "54395014",
          "title": "Coinbase Ventures-Backed Supra Offers $1M Bounty to Beat Its Parallel EVM Execution Engine",
          "body": "",
          "published_at": 1763134541,
          "source": "CryptoCompare",
          "url": "https://www.investing.com/news/cryptocurrency-news/coinbase-venturesbacked-supra-offers-1m-bounty-to-beat-its-parallel-evm-execution-engine-4359538",
          "categories": [
            "EXCHANGE",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "54394983",
          "title": "Cardano (ADA) Price Analysis  for November 14",
          "body": "Can bulls keep the price of Cardano (ADA) above $0.50?",
          "published_at": 1763134440,
          "source": "CryptoCompare",
          "url": "https://u.today/cardano-ada-price-analysis-for-november-14",
          "categories": [
            "ADA",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cardano Price Prediction",
            "ADA"
          ]
        },
        {
          "id": "54394915",
          "title": "Bitcoin Tracks Nasdaq Losses, Not Its Rallies",
          "body": "Bitcoin remains tightly correlated with the Nasdaq-100, but only in ways that hurt. Despite trading near record highs, BTC continues to react far more aggressively to equity market declines than rallies, an unusual dynamic that signals investor fatigue rather than market euphoria. BTC Tracks Equities, But Only on the Downside Bitcoin’s relationship with equities is",
          "published_at": 1763134356,
          "source": "CryptoCompare",
          "url": "https://news.bitcoin.com/bitcoin-tracks-nasdaq-losses-not-its-rallies/",
          "categories": [
            "BTC",
            "BUSINESS",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Markets and Prices",
            "Bitcoin (BTC)",
            "nasdaq"
          ]
        },
        {
          "id": "54395087",
          "title": "Strategy moves 38,657 BTC, sparking sell-off rumors as Saylor insists the firm is still buying",
          "body": "Strategy sparked rumors of selling some of its BTC holdings, as some of the company’s known wallets started moving BTC. Michael Saylor, Strategy’s executive chairman, denied the rumors and said they are actually buying BTC. Strategy’s wallets originated several large-scale transactions, moving a total of 38,657 BTC from known public addresses. Some of the coins were moved to new wallets , with no further transactions. Strategy performed several transactions, with funds sent to Coinbase Custody w",
          "published_at": 1763134308,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/strategy-moves-its-btc-holdings/",
          "categories": [
            "BTC",
            "BUSINESS",
            "EXCHANGE",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "BTC",
            "MSTR"
          ]
        },
        {
          "id": "54394966",
          "title": "Cardano Price Prediction: ADA Clings to $0.50 – If This Level Breaks, It Could Be a Long Way Down",
          "body": "Bitcoin just dropped below $100k for the first time in six months, and as you’d expect, altcoins are getting absolutely wrecked, and they were already having a rough year to begin with. Cardano’s feeling the pain too. ADA just hit its lowest level in a year at $0.50, which is a straight-up bear market level. If it loses this support level, we could be looking at a serious drop ahead. But here’s where it gets interesting: the whales are buying. Big holders just scooped up over 348 million ADA, wo",
          "published_at": 1763134300,
          "source": "CryptoCompare",
          "url": "https://cryptonews.com/news/cardano-price-prediction-ada-clings-to-0-50-if-this-level-breaks-it-could-be-a-long-way-down/",
          "categories": [
            "ADA",
            "ALTCOIN",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Price Analysis",
            "ADA",
            "Adoption",
            "Altcoins",
            "Cardano"
          ]
        },
        {
          "id": "54394881",
          "title": "Pi Coin Price Prediction: Momentum Dead, Volume Crashing – Brutal Crash to $0 Possible?",
          "body": "Look, let’s call it what it is: PI coin has been tanking hard since it went live, and it’s not getting any better. Everyone knew there’d be issues after launch because they basically handed out free coins to millions of users, but these “issues” are starting to look more like fundamental problems that might not have a fix. Nothing they’re trying seems to be working. The Pi Core team just dropped a new guide on how to create tokens on their network, getting ready for the Mainnet v23 update. Sure,",
          "published_at": 1763134221,
          "source": "CryptoCompare",
          "url": "https://cryptonews.com/news/pi-coin-price-prediction-momentum-dead-volume-crashing-brutal-crash-to-0-possible/",
          "categories": [
            "ALTCOIN",
            "BLOCKCHAIN",
            "MINING",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Price Analysis",
            "Altcoins",
            "Blockchain",
            "pi coin",
            "Pi Network"
          ]
        },
        {
          "id": "54394896",
          "title": "Stunning XRP Whale Activity: 96 Million Tokens Vanish from Coinbase in $221 Million Mystery Transfer",
          "body": "BitcoinWorld Stunning XRP Whale Activity: 96 Million Tokens Vanish from Coinbase in $221 Million Mystery Transfer In a stunning development that’s shaking the cryptocurrency world, Whale Alert has reported massive XRP whale activity involving 96,269,897 XRP tokens suddenly moving from Coinbase to an unknown wallet. This colossal transaction, valued at approximately $221 million, represents one of the most significant XRP whale activity events this year, leaving market observers scrambling for an",
          "published_at": 1763134213,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/xrp-whale-activity-mystery-transfer/",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "BLOCKCHAIN",
            "CRYPTOCURRENCY",
            "Digital Assets",
            "whale transactions",
            "XRP"
          ]
        },
        {
          "id": "54394852",
          "title": "Why Are The Bitcoin, Ethereum, And Dogecoin Prices Down Again?",
          "body": "The cryptocurrency market is experiencing a wave of declines, leaving investors concerned as the Bitcoin, Ethereum, and Dogecoin prices fall sharply. Despite experiencing a period of recovery earlier this week, all three digital assets are now facing renewed downward pressure. The latest price declines are driven by both macroeconomic uncertainty and internal market factors, underscoring how sensitive the crypto market remains to changes in investor sentiment. FED Skepticism Fuel Decline In Bitc",
          "published_at": 1763134203,
          "source": "CryptoCompare",
          "url": "https://www.newsbtc.com/news/bitcoin-ethereum-dogecoin-down/",
          "categories": [
            "BTC",
            "ETH",
            "MARKET",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency Market News",
            "Bank of Minneapolis",
            "bitcoin",
            "Bitcoin news",
            "bitcoin price",
            "btc",
            "BTC news",
            "btc price",
            "btcusd",
            "BTCUSDT",
            "CoinMarketCap",
            "ethereum",
            "fed",
            "federal reserve",
            "FOMC Meeting",
            "Neel Kashkari",
            "pot Bitcoin ETF"
          ]
        },
        {
          "id": "54394856",
          "title": "Institutions Killed Bitcoin’s Spirit, Claims Legendary Trader Peter Brandt as BTC Price Slips Below $100,000",
          "body": "Bitcoin stopped being the people's asset and lost the spirit that built it, argued legendary trader Peter Brandt as the prime cryptocurrency lost the $100,000 price tag, and there is no \"plunge protection\" yet.",
          "published_at": 1763134200,
          "source": "CryptoCompare",
          "url": "https://u.today/institutions-killed-bitcoins-spirit-claims-legendary-trader-peter-brandt-as-btc-price-slips-below",
          "categories": [
            "BTC",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Peter Brandt"
          ]
        },
        {
          "id": "54395425",
          "title": "Prediction markets, DATs, the fee switch, and Project Crypto",
          "body": "Jeff Yass bets that prediction markets could stop wars, Paul Atkins’ announcement on “tokens,” and more",
          "published_at": 1763134091,
          "source": "CryptoCompare",
          "url": "https://blockworks.co/news/prediction-markets-dats-project-crypto",
          "categories": [
            "MARKET"
          ],
          "tags": [
            "Policy",
            "The Breakdown"
          ]
        },
        {
          "id": "54395477",
          "title": "SUI Price Prediction: Bears Control Market As EMA Ceiling Blocks Every Rally Attempt",
          "body": "SUI price today trades near $1.78, struggling after repeated rejections from the descending trendline and key EMAs. Coinglass data shows $6.61M in outflows, extending months of distribution as traders continue reducing exposure. Losing $1.65 support could open the path toward $1.50, while a recovery above $2.00 is needed to confirm stabilization. SUI price today trades near $1.78, sitting at its lowest level in weeks after a sharp drop through intraday support. The decline follows persistent neg",
          "published_at": 1763134059,
          "source": "CryptoCompare",
          "url": "https://coinedition.com/sui-price-prediction-bears-control-market-as-ema-ceiling-blocks-every-rally-attempt/",
          "categories": [
            "MARKET",
            "TRADING",
            "SUI",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Market",
            "News",
            "Price Analysis",
            "Price Prediction",
            "Sui (SUI)"
          ]
        },
        {
          "id": "54394754",
          "title": "Ethereum on the Line as Binance and BlackRock Sell Into Whale Bids",
          "body": "Ethereum is caught between heavy selling from major players and fresh whale demand at a fragile $3,200 support zone. As Binance and BlackRock offload about $1 billion in ETH, large spot orders and key chart levels now decide the token’s next move. Binance and BlackRock extend heavy ETH outflows as $1B leaves wallets Fresh data from Arkham shows a sharp wave of Ethereum outflows from major Binance wallets in the past few hours, adding pressure to a trend that has unfolded for three straight days.",
          "published_at": 1763134005,
          "source": "CryptoCompare",
          "url": "https://coinpaper.com/12365/ethereum-on-the-line-as-binance-and-black-rock-sell-into-whale-bids",
          "categories": [
            "ETH",
            "EXCHANGE",
            "MARKET",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Ethereum"
          ]
        },
        {
          "id": "54394695",
          "title": "Shocking Truth: 99% of Bitcoin Investors Face Major Losses According to Glassnode Data",
          "body": "BitcoinWorld Shocking Truth: 99% of Bitcoin Investors Face Major Losses According to Glassnode Data Are you among the 99% of Bitcoin investors currently facing losses? Recent data from Glassnode reveals a startling reality that has shaken the cryptocurrency community. If you purchased Bitcoin around the $96,000 mark in the last 155 days, you’re likely experiencing significant financial pressure right now. What Does Glassnode’s Data Reveal About Bitcoin Investors? Glassnode’s latest report delive",
          "published_at": 1763133912,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/bitcoin-investors-face-losses/",
          "categories": [
            "BTC",
            "BUSINESS",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "BITCOIN",
            "BLOCKCHAIN",
            "CRYPTOCURRENCY",
            "Investment",
            "Market Analysis"
          ]
        },
        {
          "id": "54394705",
          "title": "Where is BNB Price Headed as $8.20M is Erased from the Market?",
          "body": "BNB technical indicators show the altcoin could experience further decline as liquidation events punish the bulls. BNB, the native token of the Binance ecosystem, mirrors the turbulence in the broader crypto market sector. Visit Website",
          "published_at": 1763133823,
          "source": "CryptoCompare",
          "url": "https://thecryptobasic.com/2025/11/14/where-is-bnb-price-headed-as-8-20m-is-erased-from-the-market/",
          "categories": [
            "ALTCOIN",
            "MARKET",
            "TRADING",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "Latest Binance Coin (BNB) News Market Updates"
          ]
        },
        {
          "id": "54394768",
          "title": "BingX Unveils Listing FastTrack for Swift and Transparent Token Onboarding",
          "body": "PANAMA CITY, November 14, 2025 – BingX , a leading cryptocurrency exchange and Web3 AI company, today announced the launch of Listing FastTrack , a faster gateway for innovative projects to be listed on BingX, backed by enhanced support and pioneering infrastructure and security. Listing FastTrack is BingX’s new portal where projects can apply for token listing on BingX in a shorter and simpler process, with a transparent fee schedule. The applications will be submitted directly to BingX’s exclu",
          "published_at": 1763133747,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/bingx-unveils-listing-fasttrack-for-swift-and-transparent-token-onboarding/",
          "categories": [
            "BLOCKCHAIN",
            "EXCHANGE",
            "TRADING",
            "TOKEN LISTING AND DELISTING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Press Release"
          ]
        },
        {
          "id": "54394621",
          "title": "Detroit Man Jailed for 9 Years Over Bitcoin Donations Intended for ISIS",
          "body": "Operating “in the shadows,” the man sent Bitcoin to a federal informant he believed was an ISIS operative.",
          "published_at": 1763133626,
          "source": "CryptoCompare",
          "url": "https://decrypt.co/348696/detroit-man-jailed-for-9-years-over-bitcoin-donations-intended-for-isis",
          "categories": [
            "BTC",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "",
            "Law and Order"
          ]
        },
        {
          "id": "54394576",
          "title": "MicroStrategy Cracks Below NAV as Bitcoin Enters ‘Danger Zone’",
          "body": "MicroStrategy’s slide below the value of its Bitcoin stash, heavy outflows from Strategy wallets and a key chart breakdown are sharpening focus on the firm’s role in the latest BTC sell-off. Together, new data and trader warnings point to rising concern that forced selling from the company could add fresh pressure to Bitcoin. MicroStrategy trades below Bitcoin net asset value for first time, analyst says Bitcoin’s latest slide comes as MicroStrategy’s market value drops below the worth of its Bi",
          "published_at": 1763133614,
          "source": "CryptoCompare",
          "url": "https://coinpaper.com/12364/micro-strategy-cracks-below-nav-as-bitcoin-enters-danger-zone",
          "categories": [
            "BTC",
            "EXCHANGE",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Crypto"
          ]
        },
        {
          "id": "54394701",
          "title": "Market Veteran: If Bitcoin Loses This Level, The Bear Market is Confirmed",
          "body": "Ki Young Ju, the CEO of CryptoQuant, has identified the level that, if lost, would confirm Bitcoin (BTC) has entered a bear market. The veteran analyst disclosed this in a post on X today on the back of the panic that has followed Bitcoin's latest downward trend. Visit Website",
          "published_at": 1763133521,
          "source": "CryptoCompare",
          "url": "https://thecryptobasic.com/2025/11/14/market-veteran-if-bitcoin-loses-this-level-the-bear-market-is-confirmed/",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Market",
            "Bitcoin Price Prediction",
            "Latest Bitcoin (BTC) News Today"
          ]
        },
        {
          "id": "54394532",
          "title": "BITO: I May Buy It To Monetize My Holdings, If Bitcoin Ever Reaches $1 Million",
          "body": "Summary The ProShares Bitcoin ETF offers an artificial, variable yield by investing in Bitcoin futures and swaps, not direct BTC exposure. BITO's yield is unpredictable, subject to hefty fees, and creates taxable events, making it less attractive than holding BTC or spot Bitcoin ETFs (e.g., IBIT). BITO may suit early Bitcoin investors seeking to monetize holdings without full liquidation, but its use case is now niche given spot ETF alternatives. I maintain a HOLD rating on BITO due to its limit",
          "published_at": 1763133471,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/article/4843845-bito-i-may-buy-monetize-holdings-bitcoin-reaches-1-million?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=article",
          "categories": [
            "BTC",
            "BUSINESS",
            "FIAT",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "BITO"
          ]
        },
        {
          "id": "54394447",
          "title": "Hyperliquid loses $4.9M in POPCAT price attack as new on-chain evidence points to BTX Capital",
          "body": "The decentralized derivatives platform Hyperliquid suffered a loss of about $4.9 million in a market manipulation of POPCAT token prices. After days of Crypto Twitter pointing to Binance’s CZ, analysts have found a new suspect. BTX Capital and founder Vanessa Cao have been accused of involvement in the manipulation, a claim she vehemently denies. On November 12, an attacker used over 26 wallets to create a buy wall of about $25 million buys on POPCAT to inflate the price and create an illusion o",
          "published_at": 1763133266,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/btx-capital-vanessa-cao-popcat-manipulation/",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "TRADING",
            "ZRX",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "BTX capital",
            "Hyperliquid",
            "POPCAT"
          ]
        },
        {
          "id": "54394594",
          "title": "Coinbase Ventures-Backed Supra Offers $1M Bounty to Beat Its Parallel EVM Execution Engine",
          "body": "Zug, Switzerland, November 14th, 2025, Chainwire Supra , the first Layer-1 blockchain built for Automatic DeFi (AutoFi) via full vertical integration, is proud to announce an expansion of its SupraEVM Beta Bounty . CEO and Co-Founder Joshua Tobkin has committed up to $1 million worth of his own $SUPRA tokens as a personal bounty to any developer or research team that can demonstrate a faster, verifiably correct EVM-parallel execution engine than SupraBTM, the core execution engine powering Supra",
          "published_at": 1763133248,
          "source": "CryptoCompare",
          "url": "https://cryptodaily.co.uk/2025/11/coinbase-ventures-backed-supra-offers-1m-bounty-to-beat-its-parallel-evm-execution-engine",
          "categories": [
            "BLOCKCHAIN",
            "EXCHANGE",
            "SPONSORED",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "More News"
          ]
        },
        {
          "id": "54394378",
          "title": "WazirX CEO Clears Air on Fund Misappropriations & Future Plan",
          "body": "Key Highlights: WazirX CEO Nischal Shetty comes forward for an interview for the first time since the hack.…",
          "published_at": 1763133205,
          "source": "CryptoCompare",
          "url": "https://www.cryptonewsz.com/wazirx-ceo-fund-misappropriation-future-plan/",
          "categories": [
            "OTHER"
          ],
          "tags": [
            "Cryptocurrency Exchange News"
          ]
        },
        {
          "id": "54394848",
          "title": "Bitcoin Dips Below $95K Amid Sharper Altcoin Losses and Surging Liquidations",
          "body": "Bitcoin’s price has plunged below $95,000 for the first time in six months, but altcoins like Ethereum and Solana have faced steeper declines amid rising crypto liquidations totaling $1.36 billion",
          "published_at": 1763133128,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/bitcoin-dips-below-95k-amid-sharper-altcoin-losses-and-surging-liquidations/",
          "categories": [
            "ALTCOIN",
            "BTC",
            "ETH",
            "SOL",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "BTC"
          ]
        }
      ],
      "timestamp": 1763136399354,
      "ttl": 900
    }
  },
  "saved_at": 1763136399354
}