{
  "cryptocompare_cache": {
    "cryptocompare_all": {
      "data": [
        {
          "id": "54389194",
          "title": "Revolutionary: Binance Alpha Adds PLAYSOLANA for Early Crypto Investors",
          "body": "BitcoinWorld Revolutionary: Binance Alpha Adds PLAYSOLANA for Early Crypto Investors Exciting news for cryptocurrency enthusiasts! Binance Alpha has just announced a groundbreaking addition to its platform – PLAYSOLANA. This strategic move demonstrates Binance’s commitment to providing cutting-edge opportunities for early-stage crypto investors. The platform continues to expand its offerings, giving users exclusive access to promising digital assets before they hit mainstream markets. What Does ",
          "published_at": 1763122820,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/binance-alpha-adds-playsolana-crypto/",
          "categories": [
            "BUSINESS",
            "EXCHANGE",
            "MARKET",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "Binance Alpha",
            "Binance wallet",
            "CRYPTOCURRENCY",
            "Early-stage Coins",
            "PLAYSOLANA"
          ]
        },
        {
          "id": "54389181",
          "title": "Famous US CEO Comments \"Bitcoin Bullishness Is Just Beginning!\" Amid Sharp Declines! \"Because Nothing Is the Same in Bitcoin!\"",
          "body": "The longest shutdown in history by the US government, the cessation of access to major economic indicators due to the shutdown, the increasing uncertainty regarding the FED's interest rate cut and its hawkish statements caused a sharp correction in Bitcoin (BTC) and altcoins. While the recent increase in sudden and sharp corrections in Bitcoin has also increased bearish rhetoric, Bitwise CEO spoke clearly about the bearish rhetoric. Bringing a different perspective to bearish rhetoric, Bitwise C",
          "published_at": 1763122810,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/famous-us-ceo-comments-bitcoin-bullishness-is-just-beginning-amid-sharp-declines-because-nothing-is-the-same-in-bitcoin/",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "Bitcoin",
            "News"
          ]
        },
        {
          "id": "54389125",
          "title": "Cardano Falls 10% In Selloff",
          "body": "",
          "published_at": 1763122735,
          "source": "CryptoCompare",
          "url": "https://www.investing.com/news/cryptocurrency-news/cardano-falls-10-in-selloff-4358625",
          "categories": [
            "ADA",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "54389018",
          "title": "Revolutionary Harvey AI: How Winston Weinberg’s $8B Legal Tech Startup is Transforming the Industry",
          "body": "BitcoinWorld Revolutionary Harvey AI: How Winston Weinberg’s $8B Legal Tech Startup is Transforming the Industry Imagine transforming from a first-year legal associate to building one of Silicon Valley’s most explosive startups in just a few years. That’s exactly what Winston Weinberg achieved with Harvey AI, a legal technology platform that’s revolutionizing how lawyers work while attracting every top-tier investor from Sequoia Capital to Andreessen Horowitz. The company’s staggering rise from ",
          "published_at": 1763122511,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/harvey-ai-legal-technology-startup/",
          "categories": [
            "BUSINESS",
            "MARKET",
            "REGULATION",
            "TECHNOLOGY",
            "RESEARCH"
          ],
          "tags": [
            "AI News",
            "Artificial Intelligence",
            "Innovation",
            "Legal Tech",
            "Startup",
            "VENTURE CAPITAL"
          ]
        },
        {
          "id": "54389033",
          "title": "Running for the Exits: Crypto Daybook Americas",
          "body": "Your day-ahead look for Nov. 14, 2025",
          "published_at": 1763122500,
          "source": "CryptoCompare",
          "url": "https://www.coindesk.com/daybook-us/2025/11/14/running-for-the-exits-crypto-daybook-americas",
          "categories": [
            "OTHER"
          ],
          "tags": [
            "Crypto Daybook Americas",
            "Crypto Daybook Americas",
            "News"
          ]
        },
        {
          "id": "54388983",
          "title": "Best Crypto to Buy & HODL as $BTC Drops to 6-Month Low",
          "body": "Quick Facts: Bitcoin’s slide under $100K erased $250M in $BTC longs, but community sentiment is still net-bullish, hinting at a constructive dip. Best Wallet Token ($BEST) combines fee discounts, staking, and roadmap utility, with a modeled potential high of $0.62 in 2026. PepeNode ($PEPENODE) fuses meme energy with a burn-to-earn game loop; external models outline 2025–2026 upside if listings and gameplay land. XRP ($XRP) gives you deep liquidity and low-cost, near instant settlement. Bitcoin’s",
          "published_at": 1763122470,
          "source": "CryptoCompare",
          "url": "https://bitcoinist.com/best-crypto-to-buy-and-hodl-during-bitcoin-6-month-low/",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News"
          ]
        },
        {
          "id": "54388955",
          "title": "Why Is Crypto Down Today? – November 14, 2025",
          "body": "The crypto market is down today and by a significantly higher percentage than over the past few days, with the cryptocurrency market capitalisation decreasing by 5.6%, now standing at $3.38 trillion. 96 of the top 100 coins have dropped over the past 24 hours. At the same time, the total crypto trading volume is at $254 billion. TLDR: The crypto market capitalisation is down by 5.6% on Friday morning (UTC); 96 of the top 100 coins and all top 10 coins are down today; BTC decreased by 6.2% to $97",
          "published_at": 1763122315,
          "source": "CryptoCompare",
          "url": "https://cryptonews.com/news/why-is-crypto-down-today-november-14-2025/",
          "categories": [
            "BTC",
            "ETH",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin News",
            "Bitcoin",
            "Cryptocurrency",
            "Ethereum",
            "Market"
          ]
        },
        {
          "id": "54388946",
          "title": "Altcoins Hold Strong Amid Market Slide: Can They Still Recover?",
          "body": "The total market capitalization for all cryptocurrencies, excluding Bitcoin, suggests that the altcoins aren’t done yet. Approaching strong support, the Total2 chart provides hope that this bull market is not over yet. Bitcoin will decide, but altcoins above major support Source: TradingView While Bitcoin (BTC) is at the very brink of a descent into potential bear market territory on Friday morning, the altcoin market cap is approaching its own strong support. A major horizontal support level an",
          "published_at": 1763122230,
          "source": "CryptoCompare",
          "url": "https://cryptodaily.co.uk/2025/11/altcoins-hold-strong-amid-market-slide-can-they-still-recover",
          "categories": [
            "ALTCOIN",
            "BTC",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Breaking News"
          ]
        },
        {
          "id": "54388905",
          "title": "Decentralized Exchange Breakthrough: Aden Triumphantly Resumes Korean Language Support",
          "body": "BitcoinWorld Decentralized Exchange Breakthrough: Aden Triumphantly Resumes Korean Language Support Great news for Korean crypto traders! Aden, a leading decentralized exchange, has made a significant move by restoring Korean language support. This decision comes after a crucial regulatory clarification that’s creating waves across the cryptocurrency landscape. Why Did This Decentralized Exchange Resume Korean Support? The turning point arrived when South Korea’s Financial Intelligence Unit prov",
          "published_at": 1763122211,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/decentralized-exchange-korean-support/",
          "categories": [
            "ASIA",
            "EXCHANGE",
            "REGULATION",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "#KOREA",
            "BLOCKCHAIN",
            "CRYPTOCURRENCY",
            "DEX",
            "REGULATION"
          ]
        },
        {
          "id": "54389085",
          "title": "SMIC warns of a lean 2026 for automotive and consumer tech sectors",
          "body": "SMIC believes that 2026 will have companies reducing their supply due to memory chip shortages as the tech industry’s focus has shifted from general-purpose electronics to AI-driven products, affecting many device industries across the market. The Chinese chipmaker SMIC has warned that a shortage of memory chips may disrupt the operations of manufacturers of cars, smartphones and other consumer electronics in 2026. The company’s co-CEO Zhao Haijun, said that some of SMIC’s customers are “relucta",
          "published_at": 1763122206,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/smic-predicts-lean-2026-auto-electronics/",
          "categories": [
            "ASIA",
            "BUSINESS",
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Tech",
            "CNY",
            "Huawei",
            "Micron",
            "SK Hynix",
            "SMIC"
          ]
        },
        {
          "id": "54388809",
          "title": "Morning Crypto Report: XRP Hit by 10,250% Liquidation Imbalance, Shiba Inu (SHIB) Bleeds $420 Million in 24 Hours, Binance Founder CZ Reacts to Bitcoin Below $1...",
          "body": "Friday on the crypto market opens up with pressure as XRP suffers an 800% liquidation imbalance, SHIB meme coin erases $420 million in value in a day and Bitcoin slips under $100,000 as Binance founder CZ delivers cryptic remark.",
          "published_at": 1763122080,
          "source": "CryptoCompare",
          "url": "https://u.today/morning-crypto-report-xrp-hit-by-10250-liquidation-imbalance-shiba-inu-shib-bleeds-420-million-in",
          "categories": [
            "BTC",
            "SHIB",
            "XRP",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "XRP"
          ]
        },
        {
          "id": "54388749",
          "title": "Best Meme Coins To Buy As Dogecoin Lines Up A 5x Setup",
          "body": "Quick Facts: Bitcoin long-term holders have dumped roughly 815K $BTC while whales accumulated 45K $BTC, a classic sign of risk rotation toward deep-pocketed buyers. Dogecoin is consolidating in a fresh weekly accumulation zone, with technical structures that historically preceded multi-x rallies and renewed meme-sector interest. Bitcoin Hyper, Maxi Doge, and FLOKI ride that same meme-sector tailwind while adding utility narratives ranging from Bitcoin Layer-2 scaling to gamified trading ecosyste",
          "published_at": 1763122010,
          "source": "CryptoCompare",
          "url": "https://bitcoinist.com/best-meme-coins-to-buy-dogecoin-price-prediction-5x/",
          "categories": [
            "BTC",
            "DOGE",
            "TRADING",
            "FLOKI",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News"
          ]
        },
        {
          "id": "54388752",
          "title": "EU Considers Expanding ESMA Oversight for Crypto Providers Amid USDC Rise",
          "body": "The European Commission proposes granting the European Securities and Markets Authority (ESMA) direct supervisory powers over all crypto-asset service providers (CASPs) in the EU, aiming to centralize oversight under MiCA",
          "published_at": 1763121995,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/eu-considers-expanding-esma-oversight-for-crypto-providers-amid-usdc-rise/",
          "categories": [
            "MARKET",
            "REGULATION",
            "USDC",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Regulation",
            "USDC"
          ]
        },
        {
          "id": "54388723",
          "title": "Pundit: People May Think This XRP ETF Chart Is Bad",
          "body": "When investors first glance at the spot XRP ETF (XRPC) chart, they may assume the launch was underwhelming. The candle patterns on day one do look cautious, and XRP’s price did not explode on opening. But that narrative misses a critical, powerful point lurking underneath the surface. Vincent Kennedy highlighted a fact that flips the pessimistic reading: XRPC recorded $58 million in first-day trading volume , according to his post. That figure makes it the strongest ETF debut of 2025, narrowly s",
          "published_at": 1763121920,
          "source": "CryptoCompare",
          "url": "https://timestabloid.com/pundit-people-may-think-this-xrp-etf-chart-is-bad/",
          "categories": [
            "BUSINESS",
            "MARKET",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency",
            "News",
            "XRP",
            "XRP ETF"
          ]
        },
        {
          "id": "54388570",
          "title": "Crypto Titan Grayscale Joins IPO Rush In The US: What Investors Need To Know",
          "body": "Following the conclusion of the recent US government shutdown, Grayscale, the industry’s leading asset manager, has made a significant move by filing for its initial public offering (IPO) with US regulators. This step aligns with a trend where several crypto-focused companies have been increasingly entering the IPO race, reflecting the growing prominence of digital assets within the financial landscape. Grayscale’s IPO Revelation Grayscale initiated the IPO process confidentially back in July, w",
          "published_at": 1763121634,
          "source": "CryptoCompare",
          "url": "https://bitcoinist.com/crypto-titan-grayscale-joins-ipo-rush-in-the-us/",
          "categories": [
            "BTC",
            "BUSINESS",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "crypto",
            "Crypto IPO",
            "crypto IPO news",
            "crypto news",
            "GRAY",
            "Grayscale",
            "Grayscale Bitcoin Investment",
            "Grayscale IPO"
          ]
        },
        {
          "id": "54388604",
          "title": "Bitcoin Price Plummets: Shocking Drop Below $96,000 Shakes Crypto Market",
          "body": "BitcoinWorld Bitcoin Price Plummets: Shocking Drop Below $96,000 Shakes Crypto Market The cryptocurrency world received a jolt today as the Bitcoin price experienced a significant downturn, falling below the crucial $96,000 threshold. According to Bitcoin World market monitoring, BTC is currently trading at $95,978.62 on the Binance USDT market, marking one of the most notable declines in recent weeks. What’s Driving This Bitcoin Price Decline? Market analysts point to several factors influencin",
          "published_at": 1763121612,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/bitcoin-price-drops-below-96000/",
          "categories": [
            "BTC",
            "BUSINESS",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "BITCOIN",
            "CRYPTOCURRENCY",
            "Investment",
            "Market Analysis",
            "trading."
          ]
        },
        {
          "id": "54388656",
          "title": "Gambling on ASTER and UNI Breakouts? Zero Knowledge Proof’s Pods Generate Real Monthly Income of $1,500",
          "body": "Everyone is watching the Aster (ASTER) breakout level and the latest Uniswap (UNI) breakout prediction. People are searching for the next big win. But what if focusing on charts means you’re missing the real ground-floor opportunity? Remember when laptop Bitcoin mining made millionaires? That chance is gone but there are similar opportunities now. Zero Knowledge Proof introduces Proof Pods. For $249, you’re not buying speculative tokens; you are buying income-generating infrastructure. These pod",
          "published_at": 1763121604,
          "source": "CryptoCompare",
          "url": "https://timestabloid.com/gambling-on-aster-and-uni-breakouts-zero-knowledge-proofs-pods/",
          "categories": [
            "BTC",
            "SPONSORED",
            "TRADING",
            "UNI",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Finance",
            "News"
          ]
        },
        {
          "id": "54389146",
          "title": "Retail Traders Left Exposed in High-Stakes Crypto Treasury Deals",
          "body": "Executives are turning to a novel structure to fund crypto accumulation vehicles as investor appetite thins.",
          "published_at": 1763121600,
          "source": "CryptoCompare",
          "url": "https://www.bloomberg.com/news/articles/2025-11-14/retail-traders-left-exposed-in-high-stakes-crypto-treasury-deals",
          "categories": [
            "BUSINESS",
            "REGULATION",
            "DIGITAL ASSET TREASURY",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "54388626",
          "title": "Ripple (XRP) Price Turmoil, Dogecoin (DOGE) Whales Wake up, and More: Bits Recap Nov 14",
          "body": "Ripple’s cross-border token has experienced substantial volatility over the past several days and is currently in the red on a daily scale. Dogecoin (DOGE) also posted substantial losses despite the accumulation efforts of the whales. In this article, we will focus on the performance of these cryptocurrencies and examine the latest developments surrounding Shiba Inu (SHIB). XRP’s Price Swings Ripple’s token surged to nearly $2.60 on November 11, likely driven by investor excitement surrounding t",
          "published_at": 1763121568,
          "source": "CryptoCompare",
          "url": "https://cryptopotato.com/ripple-xrp-price-turmoil-dogecoin-doge-whales-wake-up-and-more-bits-recap-nov-14/",
          "categories": [
            "DOGE",
            "SHIB",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto Bits",
            "Crypto News",
            "Dogecoin",
            "Ripple (XRP) Price",
            "Shiba Inu (SHIB)"
          ]
        },
        {
          "id": "54388611",
          "title": "XRP ETF Day 1 performance surprises traders on Nasdaq",
          "body": "Canary Capital’s newly launched spot XRP ETF (XRPC) made a strong debut on Thursday, November 13. The fund generated $26 million in trading volume within the first 30 minutes, and by the end of the session, it had recorded more than $58.5 million in total volume and $245 million in net inflows. Despite the compelling first day, XRPC’s initial volume still falls short compared to the launches of Bitcoin ( BTC ) and Ethereum ( ETH ) spot ETFs, which saw $4.1 billion and $1.1 billion in day-one tra",
          "published_at": 1763121565,
          "source": "CryptoCompare",
          "url": "https://finbold.com/xrp-etf-day-1-performance-surprises-traders-on-nasdaq/",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency news",
            "Canary XRP ETF (XRPC)",
            "crypto",
            "cryptocurrency",
            "XRP",
            "xrp etf",
            "XRPC"
          ]
        },
        {
          "id": "54388782",
          "title": "European Commission advances push to centralize crypto regulation",
          "body": "The European Commission is pushing for extended oversight powers for the European Securities and Markets Authority (ESMA). Draft plans have shown a proposal to make ESMA a direct supervisor for all crypto service providers in the EU. EU officials have drafted plans to tighten crypto oversight , with more power in the hands of ESMA. Currently, crypto firms in the EU rely on registration within a single jurisdiction, choosing countries with lenient crypto rules. Under the active Markets in Cryptoa",
          "published_at": 1763121498,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/european-commission-centralize-crypto-body/",
          "categories": [
            "MARKET",
            "REGULATION",
            "TRADING",
            "USDT",
            "USDC",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Regulation",
            "BTC",
            "ESMA",
            "EUR",
            "USDC",
            "USDT"
          ]
        },
        {
          "id": "54388741",
          "title": "XRP ETF’s Record Launch Fuels Potential Bullish Shift Among Top Traders",
          "body": "Canary Capital’s XRP ETF achieved the highest first-day performance among over 900 ETF launches in 2025, with $58 million in trading volume and $250 million in inflows, signaling strong demand",
          "published_at": 1763121385,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/xrp-etfs-record-launch-fuels-potential-bullish-shift-among-top-traders/",
          "categories": [
            "BTC",
            "ETH",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "BTC",
            "ETH",
            "SOL",
            "XRP"
          ]
        },
        {
          "id": "54388418",
          "title": "Stunning Anonymous Whale Accumulates $114.5M in ETH – What This Means for Ethereum",
          "body": "BitcoinWorld Stunning Anonymous Whale Accumulates $114.5M in ETH – What This Means for Ethereum Have you ever wondered how massive cryptocurrency movements can shake the entire market? In a stunning development, an anonymous whale has just made headlines by purchasing another $114.5 million worth of Ethereum. This mysterious investor continues to accumulate ETH at an astonishing pace, raising questions about market sentiment and future price movements. Who Is This Anonymous Whale and Why Should ",
          "published_at": 1763121311,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/anonymous-whale-ethereum-purchase-2/",
          "categories": [
            "BUSINESS",
            "ETH",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News",
            "BLOCKCHAIN",
            "Crypto news",
            "CRYPTOCURRENCY",
            "ETHEREUM",
            "whale"
          ]
        },
        {
          "id": "54388740",
          "title": "Solana Positions as RWA Leader with XStocks Tokenized Shares Hitting $10B Volumes",
          "body": "XStocks tokenized shares have surged to over $10 billion in total trading volumes, establishing them as a leading option in the real-world asset (RWA) tokenization space. Solana dominates as the",
          "published_at": 1763121137,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/solana-positions-as-rwa-leader-with-xstocks-tokenized-shares-hitting-10b-volumes/",
          "categories": [
            "ETH",
            "SOL",
            "ARB",
            "BNB",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "ARB",
            "BNB",
            "ETH",
            "ONDO",
            "SOL"
          ]
        },
        {
          "id": "54388301",
          "title": "Bitcoin Price Analysis: Short-Term Holders Exit as BTC Tests Critical $102K Support",
          "body": "Short-term Bitcoin holders have transferred 29,400 BTC to exchanges at a loss, intensifying concerns about downward pressure on the cryptocurrency. The recent sell-off coincides with substantial distribution from long-term holders. These seasoned investors have offloaded approximately 815,000 BTC over the past month. This marks the highest distribution level since January 2024, adding complexity to current market dynamics. At the time of writing, Bitcoin is trading at around $96,627, suggesting ",
          "published_at": 1763121030,
          "source": "CryptoCompare",
          "url": "https://coinpaper.com/12356/bitcoin-price-analysis-short-term-holders-exit-as-btc-tests-critical-102-k-support",
          "categories": [
            "BTC",
            "BUSINESS",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "Crypto"
          ]
        },
        {
          "id": "13651265",
          "title": "SUI price prediction 2025-2031: Is SUI a good investment?",
          "body": "Key takeaways: Our SUI price prediction indicates a high of $6.77 by the end of 2025. In 2027, SUI will range between $10.47 and $12.10, with an average price of $10.83. In 2030, it will range between $33.01 and $40.39, with an average price of $34.20. Is SUI a good investment? Will it go up? Where will it be in five years? Our SUI price prediction answers these questions and more. Overview Cryptocurrency Sui Symbol SUI Current price $1.78 SUI crypto market cap $6.55B Trading volume (24-hour) $1",
          "published_at": 1763120857,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/sui-price-prediction/",
          "categories": [
            "BLOCKCHAIN",
            "BTC",
            "BUSINESS",
            "EXCHANGE",
            "ICO",
            "MARKET",
            "TRADING",
            "SUI",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto Price Predictions",
            "SUI"
          ]
        },
        {
          "id": "54388145",
          "title": "XRP erases $13 billion from its market cap in 24 hours",
          "body": "XRP has shed $13 billion from its market capitalization in the past 24 hours, sliding from $150.38 billion to $137.39 billion and pulling the price down 9% to $2.27. XRP 1-day market cap chart. Source: CoinMarketCap The reversal comes less than a day after the launch of the first U.S. spot XRP ETF on Nasdaq, a development many expected to trigger a continuation of this week’s rally. Instead, traders are increasingly pointing to a classic sell-the-news setup. After weeks of anticipation and stron",
          "published_at": 1763120748,
          "source": "CryptoCompare",
          "url": "https://finbold.com/xrp-erases-13-billion-from-its-market-cap-in-24-hours/",
          "categories": [
            "MARKET",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Cryptocurrency news",
            "canary capital",
            "cryptocurrency",
            "XRP",
            "XRPC"
          ]
        },
        {
          "id": "54388737",
          "title": "VanEck’s Solana ETF Edges Closer to Launch After Key SEC Filing, Amid $370M Inflows",
          "body": "VanEck has filed its final Form 8-A for a spot Solana ETF, signaling a potential launch within days and boosting institutional access to Solana (SOL). This comes amid 13 straight",
          "published_at": 1763120694,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/vanecks-solana-etf-edges-closer-to-launch-after-key-sec-filing-amid-370m-inflows/",
          "categories": [
            "DOGE",
            "ETH",
            "REGULATION",
            "SOL",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "DOGE",
            "ETH",
            "MOG",
            "SOL",
            "XRP"
          ]
        },
        {
          "id": "54388188",
          "title": "XRP ETF debut outshines all 2025 launches with $250M inflows, record volume",
          "body": "Canary Capital’s XRP ETF outperformed all 900 ETF launches of 2025, inspiring a bullish rotation among the industry’s most successful traders, who are now betting on XRP’s price increasing.",
          "published_at": 1763120617,
          "source": "CryptoCompare",
          "url": "https://cointelegraph.com/news/canary-xrp-etf-record-launch-250m-in-kind-redemptions?utm_source=rss_feed&utm_medium=rss%3Frand%3Dxvio6_1763120626871%26_t%3D1763120626871%26ttl%3D0%26ttt%3D1763120626871&utm_campaign=rss_partner_inbound",
          "categories": [
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            ""
          ]
        },
        {
          "id": "54388084",
          "title": "Is Bitcoin's Latest Drop a Bearish Signal? CryptoQuant CEO Explains: \"This Level Will Start a Bear Market!\"",
          "body": "Macroeconomic uncertainties, such as the US federal government's longest-ever 43-day shutdown and uncertainty surrounding the Fed's interest rate cuts, caused Bitcoin's sharp decline. While further declines and bearish rhetoric for Bitcoin increased after the sharp correction in the market, CryptoQuant CEO Ki-young Ju made important statements about the future of BTC. The famous CEO spoke clearly about the bear market, stating that it is unlikely that a bear market will occur unless the BTC pric",
          "published_at": 1763120589,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/is-bitcoins-latest-drop-a-bearish-signal-cryptoquant-ceo-explains-this-level-will-start-a-bear-market/",
          "categories": [
            "BTC",
            "MARKET",
            "TRADING",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "Bitcoin",
            "News"
          ]
        },
        {
          "id": "54384122",
          "title": "Nasdaq, S&P, Dow futures fall sharply day after Wall Street closes deep in red",
          "body": "More on markets 5 Signs Why Investors Should Be More Cautious Market Cycles, Not Headlines: What History Says About The 2025 Rally And What Comes Next AAII Sentiment Survey: Pessimism Takes Flight US Senate passes bill to end longest ever government shutdown, sending it to House",
          "published_at": 1763120577,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/news/4522115-sp500-nasdaq-dow-jones-outlook-stock-market?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=news",
          "categories": [
            "BUSINESS",
            "MARKET",
            "REGULATION",
            "TRADING",
            "MACROECONOMICS"
          ],
          "tags": [
            "SPX",
            "INDU",
            "US100:IND",
            "BTC-USD",
            "XAGUSD:CUR",
            "XAUUSD:CUR",
            "CL1:COM",
            "US10Y",
            "US2Y",
            "US30Y",
            "US5Y"
          ]
        },
        {
          "id": "54388734",
          "title": "XRP Dips on Bitcoin Selloff, But Institutional Accumulation Hints at Rebound Potential",
          "body": "XRP’s recent drop to around $2.29 stems from Bitcoin’s broader market selloff, not inherent weaknesses in the XRP ecosystem. Despite the dip, institutional investors are accumulating over 149 million XRP",
          "published_at": 1763120559,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/xrp-dips-on-bitcoin-selloff-but-institutional-accumulation-hints-at-rebound-potential/",
          "categories": [
            "BTC",
            "BUSINESS",
            "MARKET",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "BTC",
            "XRP"
          ]
        },
        {
          "id": "54388850",
          "title": "LINK dips 10%, eyes the $11 support level; check forecast",
          "body": "It will be a bearish end to the week for cryptocurrencies as Bitcoin, Ether, XRP, and other major altcoins are currently in the red. Bitcoin’s price has dropped below the $97k level, while Ether is still holding above $3k. LINK, the native coin of the Chainlink network, has lost 10% of its value in the last 24 hours and now risks dropping below $14. LINK dips below $15 despite positive news from the ecosystem LINK’s poor performance over the last 24 hours comes despite positive news from the bro",
          "published_at": 1763120486,
          "source": "CryptoCompare",
          "url": "https://invezz.com/news/2025/11/14/link-dips-10-eyes-the-11-support-level-check-forecast/",
          "categories": [
            "ALTCOIN",
            "LINK",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoins",
            "Crypto",
            "Chainlink"
          ]
        },
        {
          "id": "54387815",
          "title": "Nearly 25% of Asian Adults Online May Hold Crypto: $BEST Presale Passes $17M Milestone",
          "body": "Quick Facts: Nearly a quarter of APAC adults with internet access may own crypto, pointing to strong regional onboarding tailwinds for simple, secure wallets. Reducing friction with multi-chain support, clean swaps, and clear fee flows drives retention as first-time users move beyond their debut transaction. $BEST ties wallet utility to incentives with staking, fee perks, and launch access, aiming to convert new users into long-term participants. Reasonable price scenarios hinge on listings and ",
          "published_at": 1763120049,
          "source": "CryptoCompare",
          "url": "https://bitcoinist.com/best-wallet-token-presale-17m-apac-crypto-ownership-near-25-percent/",
          "categories": [
            "BLOCKCHAIN",
            "MARKET",
            "TRADING",
            "RESEARCH",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto News"
          ]
        },
        {
          "id": "54387780",
          "title": "OAK Mining Reaches $6,899 Daily Earnings Milestone for XRP Users",
          "body": "OAK Mining is introducing a low-risk, high-return profit model for crypto investors seeking daily income without relying on traditional trading. – OAK Mining, a rapidly developing cloud mining platform, is reportedly helping XRP holders and other cryptocurrency users generate passive income through its contract-based mining services—with daily earnings reaching up to $6,700. As short-term trading strategies face increasing uncertainty, OAK Mining offers a more stable and convenient alternative. ",
          "published_at": 1763119939,
          "source": "CryptoCompare",
          "url": "https://en.bitcoinsistemi.com/oak-mining-reaches-6899-daily-earnings-milestone-for-xrp-users-2/",
          "categories": [
            "BUSINESS",
            "MINING",
            "TRADING",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Sponsored"
          ]
        },
        {
          "id": "54388141",
          "title": "Solana rides XStocks 2025 surge to top 5 status among tokenized equities platforms",
          "body": "XStocks are becoming the tokenized shares of choice, after reaching $10B in total trading volumes. Solana is also the main carrier for actively traded RWA tokens. XStocks has shown ongoing expansion in trading activity since the launch of the new tokenized share standard. The XStocks market broke above $10B in total volumes for the first time, on a mix of activity inflows from Kraken and, more recently, Hyperliquid. Most of the trading volumes are concentrated on centralized markets, with around",
          "published_at": 1763119854,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/xstocks-daily-volume-breaks-above-solana-rwa/",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "SOL",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "News",
            "NVDA",
            "SOL",
            "TSLA"
          ]
        },
        {
          "id": "54387696",
          "title": "Fed’s Miran: Stablecoins Are ‘Transformational’ for Emerging Markets",
          "body": "Federal Reserve Governor Stephen Miran described stablecoins as innovative tools that could provide users in jurisdictions with limited access to dollar assets. Miran estimates stablecoins could help satisfy about $3 trillion of foreign demand for dollar assets in the coming years. Fed’s Miran: Stablecoins Might Prop up Demand for Dollar Assets Globally The Facts Stephen",
          "published_at": 1763119809,
          "source": "CryptoCompare",
          "url": "https://news.bitcoin.com/feds-miran-stablecoins-are-transformational-for-emerging-markets/",
          "categories": [
            "FIAT",
            "MARKET",
            "MACROECONOMICS"
          ],
          "tags": [
            "Crypto News",
            "Federal Reserve",
            "Stablecoin"
          ]
        },
        {
          "id": "54388140",
          "title": "This $0.035 New Crypto Could Be the Best Investment Before the Next Bull Run",
          "body": "With the crypto market preparing to enter what many analysts regard as the pre-bull run accumulation phase, investors are in full throttle trying to find the best crypto to buy in the near future before the market prices start soaring across the board. Traditionally, initially taking over positions in high utility projects has resulted in outsize returns when the market becomes bullish. A new token in the DeFi crypto sector that is gaining increased interest is Mutuum Finance (MUTM) , a project ",
          "published_at": 1763119800,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/this-0-035-new-crypto-could-be-the-best-investment-before-the-next-bull-run/",
          "categories": [
            "BLOCKCHAIN",
            "BUSINESS",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Press Release"
          ]
        },
        {
          "id": "54388139",
          "title": "SACHI unlocks creativity with The Locker, where players design, mint, and flex their own identities",
          "body": "[Dubai, UAE] Gamers commit hundreds of hours to games. However, between cutscenes, guided campaign modes, timed or point contests, or even battle royale modes, gamers have limited opportunities to actually insert their personality or style into games. Sometimes, they get to toggle a few character body builds before starting the game, and that’s it. SACHI’s belief in the importance of personalization in gaming is the reason it is encouraging self-expression through The Locker , a system that turn",
          "published_at": 1763119800,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/sachi-unlocks-creativity-with-the-locker-where-players-design-mint-and-flex-their-own-identities/",
          "categories": [
            "BUSINESS"
          ],
          "tags": [
            "Press Release"
          ]
        },
        {
          "id": "54388305",
          "title": "Peter Schiff Mocks Bitcoin After $97K Slide, Cites Gold’s 60% Surge",
          "body": "Peter Schiff renews his attack on Bitcoin after a break below $97,000, stoking bearish sentiment. Bitcoin supporters counter with history and cycle context as gold strength draws comparisons. Bitcoin trades near the mid-$90Ks after a volatile week; traders track liquidations and support. Bitcoin critic Peter Schiff has taken a swipe at the cryptocurrency following the latest price decline that saw BTC drop below $100,000. In his latest post on X, Schiff poked fun at Bitcoin users who celebrated ",
          "published_at": 1763119800,
          "source": "CryptoCompare",
          "url": "https://coinedition.com/peter-schiff-mocks-bitcoin-after-97k-slide-cites-golds-60-surge/",
          "categories": [
            "BTC",
            "FIAT",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Market News",
            "News",
            "Bitcoin News"
          ]
        },
        {
          "id": "54387550",
          "title": "Sony Bank stablecoin faces shocking opposition from US community bankers group",
          "body": "BitcoinWorld Sony Bank stablecoin faces shocking opposition from US community bankers group The cryptocurrency world faces another regulatory showdown as the Independent Community Bankers of America takes a firm stand against Sony Bank’s ambitious stablecoin plan. This developing story highlights the ongoing tension between traditional financial institutions and emerging digital currency innovations. Why is Sony Bank stablecoin causing controversy? The Independent Community Bankers of America (I",
          "published_at": 1763119511,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/sony-bank-stablecoin-opposition/",
          "categories": [
            "FIAT",
            "MARKET",
            "REGULATION",
            "CRYPTOCURRENCY",
            "SECURITY INCIDENTS"
          ],
          "tags": [
            "Crypto News",
            "banking",
            "cryptocurrency regulation",
            "ICBA",
            "Sony",
            "Stablecoin"
          ]
        },
        {
          "id": "54387634",
          "title": "Bitcoin ETFs Record $866M Outflows Post-US Shutdown, Raising Market Demand Concerns",
          "body": "Bitcoin ETF outflows reached $866 million on Thursday despite the end of the 43-day US government shutdown, marking the second-worst day for these funds and pushing BTC prices to a",
          "published_at": 1763119490,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/bitcoin-etfs-record-866m-outflows-post-us-shutdown-raising-market-demand-concerns/",
          "categories": [
            "BTC",
            "MARKET",
            "SOL",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Analysis",
            "Bitcoin",
            "News",
            "Ripple",
            "BTC",
            "Core",
            "SOL",
            "XRP"
          ]
        },
        {
          "id": "54388372",
          "title": "Bitcoin could retest $93K amid declining institutional demand; check forecast",
          "body": "The cryptocurrency market has continued its poor performance in November as Bitcoin failed to overcome the $107K resistance level earlier this week. The selling pressure that followed has seen Bitcoin drop below $97K for the first time since May. With the bears currently in control, Bitcoin could test lower support levels in the near term. BTC dips below $97K as spot Bitcoin ETFs suffer huge outflows Bitcoin (BTC), Ethereum (ETH), and Ripple (XRP) are trading in the red zone after correcting mor",
          "published_at": 1763119176,
          "source": "CryptoCompare",
          "url": "https://invezz.com/news/2025/11/14/bitcoin-could-retest-93k-amid-declining-institutional-demand-check-forecast/",
          "categories": [
            "ALTCOIN",
            "BTC",
            "ETH",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Altcoins",
            "Crypto",
            "Bitcoin"
          ]
        },
        {
          "id": "54387564",
          "title": "Kyrgyzstan's central bank green lights escrow accounts for commercial banks crypto deals",
          "body": "The central bank of Kyrgyzstan has permitted commercial banks to open escrow accounts specifically for operations with cryptocurrencies. This type of bank accounts offer transacting clients the option to keep funds with a third party, thus reducing risks for themselves until the deal is done. Kyrgyz banks to establish escrow accounts for crypto users The National Bank of the Kyrgyz Republic (NBKR) has authorized banking institutions in the country to set up escrow accounts for transactions invol",
          "published_at": 1763119030,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/kyrgyzstan-banks-open-escrow-accounts-crypto/",
          "categories": [
            "BTC",
            "FIAT",
            "REGULATION",
            "MACROECONOMICS",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Regulation",
            "A7A5",
            "BTC",
            "KZT",
            "USDKG"
          ]
        },
        {
          "id": "54387287",
          "title": "XRP ETF Debuts with $58M Record Volume, Suggesting Strong Investor Demand Ahead",
          "body": "The Canary Capital XRP ETF (XRPC) achieved a record $58 million in day-one trading volume, surpassing nearly 900 ETF launches this year and highlighting surging investor interest in XRP-based investment",
          "published_at": 1763118981,
          "source": "CryptoCompare",
          "url": "https://en.coinotag.com/xrp-etf-debuts-with-58m-record-volume-suggesting-strong-investor-demand-ahead/",
          "categories": [
            "BTC",
            "BUSINESS",
            "ETH",
            "XRP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Bitcoin",
            "Ethereum",
            "News",
            "BTC",
            "ETH",
            "SOL",
            "XRP"
          ]
        },
        {
          "id": "54387561",
          "title": "Blue Origin intensifies SpaceX competition with successful booster landing",
          "body": "Blue Origin has successfully landed the booster of its New Glenn rocket for the first time on Thursday, November 13, 2025. The feat, achieved on the company’s second attempt after failing in January, moves Jeff Bezos’ space venture a step further toward challenging Elon Musk’s SpaceX, whose feats and progress have long overshadowed it. A boost to rival SpaceX The New Glenn rocket lifted off from Cape Canaveral Space Force Station and carried on it NASA’s ESCAPADE mission to Mars. Three minutes i",
          "published_at": 1763118912,
          "source": "CryptoCompare",
          "url": "https://www.cryptopolitan.com/blue-origin-spacex-booster-landing/",
          "categories": [
            "EXCHANGE",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Tech",
            "Amazon",
            "Blue Origin",
            "NASA",
            "SpaceX",
            "USD"
          ]
        },
        {
          "id": "54387232",
          "title": "ETH Crashes 10%, Smart Money Piles In as Whales and Institutions Double Down",
          "body": "Ethereum (ETH) dropped sharply over the past 24 hours, losing nearly 10% to trade below $3,200. The latest plunge extended a week-long decline that has pressured the broader cryptocurrency market. Despite the downturn, accumulation continued across multiple wallets. Stealth Accumulation Wave Lookonchain reported that BitMine Immersion Technologies, the Ethereum-focused digital asset treasury (DAT) firm led by Wall Street strategist Thomas Lee, remains active in the market. The on-chain analytics",
          "published_at": 1763118838,
          "source": "CryptoCompare",
          "url": "https://cryptopotato.com/eth-crashes-10-smart-money-piles-in-as-whales-and-institutions-double-down/",
          "categories": [
            "BUSINESS",
            "ETH",
            "MARKET",
            "TRADING",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "AA News",
            "Crypto News",
            "Ethereum (ETH) Price"
          ]
        },
        {
          "id": "54387153",
          "title": "A Miracle Proven by the Community! WonderChain Rewrites Blockchain History with Web3.5, Emerging as a ‘Top-Tier Exchange Listing Candidate for 2026’",
          "body": "BitcoinWorld A Miracle Proven by the Community! WonderChain Rewrites Blockchain History with Web3.5, Emerging as a ‘Top-Tier Exchange Listing Candidate for 2026’ [Special Feature] Breaking the Record for ‘Most Media Exposure in the Shortest Time’ in Blockchain History! A New Era of Web3.5 Forged by a 140,000-Strong Community The blockchain market is currently restructuring around ‘social value’ and ‘community governance,’ moving beyond mere technological innovation. In this landscape, WonderChai",
          "published_at": 1763118771,
          "source": "CryptoCompare",
          "url": "https://bitcoinworld.co.in/a-miracle-proven-by-the-community-wonderchain-rewrites-blockchain-history-with-web3-5-emerging-as-a-top-tier-exchange-listing-candidate-for-2026/",
          "categories": [
            "BLOCKCHAIN",
            "EXCHANGE",
            "MARKET",
            "AIRDROP",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Press Release",
            "WonderChain"
          ]
        },
        {
          "id": "54387134",
          "title": "Tokenization - The Quiet Infrastructure Boom Powering The Next Financial Revolution",
          "body": "Summary Tokenization is revolutionizing finance, enabling instant, low-cost, 24/7 asset transfers and programmable money through blockchain-based stablecoins like USDC and USDT. Coinbase, Robinhood, and Circle stand out as investment opportunities, as they are leading the infrastructure buildout for digital assets and tokenized finance. Key catalysts include regulatory clarity, institutional adoption, and integration by payment giants like Visa and Mastercard, driving growth and mainstream accep",
          "published_at": 1763118684,
          "source": "CryptoCompare",
          "url": "https://seekingalpha.com/article/4843756-tokenization-the-quiet-infrastructure-boom-powering-the-next-financial-revolution?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=article",
          "categories": [
            "BLOCKCHAIN",
            "BUSINESS",
            "EXCHANGE",
            "MARKET",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "CRCL",
            "COIN",
            "HOOD"
          ]
        },
        {
          "id": "54387450",
          "title": "Early XRP and SUI investors reveal new altcoin with better potential",
          "body": "XRP and SUI holders have been riding a solid wave lately. XRP’s holding above $2.50 after the recent spot ETF filings, and SUI’s pushing past $2 on fresh developer activity. Despite these altcoins trending, a growing number of early-stage investors are pointing to a different opportunity: Opter . Opter is a decentralized perpetuals exchange where traders earn XP, unlock Prestige ranks and compound rewards through skill-based activity. Priced at just $0.02 in Stage 1 of its presale, many XRP and ",
          "published_at": 1763118621,
          "source": "CryptoCompare",
          "url": "https://invezz.com/news/2025/11/14/early-xrp-and-sui-investors-reveal-new-altcoin-with-better-potential/",
          "categories": [
            "BUSINESS",
            "TRADING",
            "XRP",
            "SUI",
            "CRYPTOCURRENCY"
          ],
          "tags": [
            "Crypto",
            "Sponsored"
          ]
        }
      ],
      "timestamp": 1763122897752,
      "ttl": 900
    }
  },
  "saved_at": 1763122897752
}